/*Напишите программу, которая выводит на консоль простые числа в
        промежутке от [2, 100].*/

public class TASK1_1 {

    public static void main(String[] args) {

        // Создаем цикл, который проходит от 2 до 101 и вывиодит в одну строку значения, которые принимает i
        for (int i = 2; i < 101; i++) {
            System.out.print(" " + i);
        }
    }
}
